# Part 1 판다스 입문

## 2. 판다스 자료 구조

In [1]:
import pandas as pd

In [2]:
dict_data = {'a':1, 'b': 2, 'c': 3}

In [3]:
print(dict_data)

{'a': 1, 'b': 2, 'c': 3}

In [4]:
sr = pd.Series(dict_data)

In [5]:
sr

a    1
b    2
c    3
dtype: int64

In [6]:
print(type(sr))
print('\n')
print(sr)

<class 'pandas.core.series.Series'>


a    1
b    2
c    3
dtype: int64

In [7]:
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)

In [8]:
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [9]:
sr

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [10]:
idx = sr.index
val = sr.values

In [11]:
print(idx)
print('\n')
print(val)

RangeIndex(start=0, stop=5, step=1)


['2019-01-02' 3.14 'ABC' 100 True]

In [12]:
tup_data = ('영인', '2010-05-01', '여', True)

In [13]:
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [14]:
sr

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [15]:
tup_data

('영인', '2010-05-01', '여', True)

In [16]:
print(sr[0])

영인

In [17]:
print(sr[1])

2010-05-01

In [18]:
print(sr['이름'])

영인

In [19]:
print(sr[[1, 2]])
print('\n')
print(sr[['생년월일', '성별']])

생년월일    2010-05-01
성별               여
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [20]:
print(sr[1:2])
print('\n')
print(sr['생년월일':'성별'])

생년월일    2010-05-01
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

### 데이터프레임

In [21]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

In [22]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [23]:
df = pd.DataFrame(dict_data)

In [24]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [25]:
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [26]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [27]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                  index=['준서', '예은'],
                  columns=['나이', '성별', '학교'])

In [28]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [29]:
print(df.index)

Index(['준서', '예은'], dtype='object')

In [30]:
print(df.columns)

Index(['나이', '성별', '학교'], dtype='object')

In [31]:
df.index=['학생1', '학생2']
df.columns=['연령', '남녀', '소속']

In [32]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [33]:
df.index

Index(['학생1', '학생2'], dtype='object')

In [34]:
df.columns

Index(['연령', '남녀', '소속'], dtype='object')

In [35]:
df=pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                index=['준서', '예은'],
                columns=['나이', '성별', '학교'])

In [36]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [37]:
df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'}, inplace=True)

In [38]:
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [39]:
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace=True)

In [40]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [41]:
exam_data = {'수학': [90, 80, 70], '영어': [98, 89, 95],
             '음악': [85, 95, 100], '체육': [100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [42]:
df2 = df.copy()
df2.drop('우현', inplace=True)
print(df2)

print('\n')

df3 = df.copy()
df3.drop(['우현', '인아'], axis=0, inplace=True)
print(df3)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90


    수학  영어  음악   체육
서준  90  98  85  100

In [43]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [44]:
df4 = df.copy()
df4.drop('수학', axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [45]:
df5 = df.copy()
df5.drop(['영어', '음악'], axis=1, inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [46]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [47]:
label1 = df.loc['서준']
position1 = df.iloc[0]

In [48]:
print(label1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [49]:
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [50]:
label2 = df.loc[['서준', '우현']]
position2 = df.iloc[[0, 1]]
print(label2)
print('\n')
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90


    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [51]:
label3 = df.loc['서준':'우현']
position3 = df.iloc[0:1]
print(label3)
print('\n')
print(position3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90


    수학  영어  음악   체육
서준  90  98  85  100

In [52]:
exam_data = {'이름': ['서준', '우현', '인아'],
             '수학': [90, 80, 70],
             '영어': [98, 89, 95],
             '음악': [85, 95, 100],
             '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [53]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [54]:
math1 = df['수학']

In [55]:
print(math1)

0    90
1    80
2    70
Name: 수학, dtype: int64

In [56]:
print(type(math1))

<class 'pandas.core.series.Series'>

In [57]:
english = df.영어
print(english)
print(type(english))

0    98
1    89
2    95
Name: 영어, dtype: int64
<class 'pandas.core.series.Series'>

In [58]:
music_gym = df[['음악', '체육']]

In [59]:
music_gym

    음악   체육
0   85  100
1   95   90
2  100   90

In [60]:
math2 = df[['수학']]
print(math2)

   수학
0  90
1  80
2  70

In [61]:
df.iloc[::2]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [62]:
df.iloc[0:3:2]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [63]:
df.iloc[::-1]

   이름  수학  영어   음악   체육
2  인아  70  95  100   90
1  우현  80  89   95   90
0  서준  90  98   85  100

In [64]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [65]:
a = df.loc['서준', '음악']
a

85

In [66]:
b = df.iloc[0, 2]

In [67]:
b

85

In [68]:
c = df.loc['서준', ['음악', '체육']]
print(c)

음악     85
체육    100
Name: 서준, dtype: int64

In [69]:
d = df.iloc[0, [2, 3]]

In [70]:
d

음악     85
체육    100
Name: 서준, dtype: int64

In [71]:
e = df.loc['서준', '음악':'체육']

In [72]:
e

음악     85
체육    100
Name: 서준, dtype: int64

In [73]:
g = df.loc[['서준', '우현'], ['음악', '체육']]
h = df.iloc[[0, 1], [2, 3]]
i = df.loc['서준':'우현', '음악':'체육']
j = df.iloc[0:2, 2:]

In [74]:
g

    음악   체육
이름
서준  85  100
우현  95   90

In [75]:
h

    음악   체육
이름
서준  85  100
우현  95   90

In [76]:
i

    음악   체육
이름
서준  85  100
우현  95   90

In [77]:
j

    음악   체육
이름
서준  85  100
우현  95   90

In [78]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [79]:
df['국어']=80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [80]:
df.loc[3] = 0
df.loc[4] = ['동규', 90, 80, 70, 60]
print(df)

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
3    0   0    0    0   0
4   동규  90   80   70  60

In [81]:
df.loc['행5'] = df.loc[3]
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
3    0   0    0    0   0
4   동규  90   80   70  60
행5   0   0    0    0   0

In [82]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
3    0   0    0    0   0
4   동규  90   80   70  60
행5   0   0    0    0   0

In [83]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
3    0   0    0    0   0
4   동규  90   80   70  60
행5   0   0    0    0   0

In [84]:
df.drop(df.index[[3, 4, 5]], inplace =True)

In [85]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [86]:
df.iloc[0][3] = 80
print(df)

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

<ipython-input-86-27e68735bb36>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.iloc[0][3] = 80

In [87]:
df.loc['서준']['체육']=90
print(df)

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

<ipython-input-87-dd663fd6d430>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc['서준']['체육']=90

In [88]:
df.loc['서준', '체육'] = 100

In [89]:
df.loc

In [90]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [91]:
df.loc['서준', ['음악', '체육']] = 50
print(df)

    수학  영어   음악  체육  국어
이름
서준  90  98   50  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80

In [92]:
df.loc['서준', ['음악', '체육']] = 100, 50

In [93]:
df

    수학  영어   음악  체육  국어
이름
서준  90  98  100  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80

In [94]:
df = pd.DataFrame(exam_data)

In [95]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [96]:
df_t = df.transpose()

In [97]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [98]:
df_t

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [99]:
df_tt = df.T
df_tt

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [100]:
a = "c"

In [101]:
##3. 인덱스 활용

In [102]:
exam_data = {'이름': ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}

In [103]:
df = pd.DataFrame(exam_data)

In [104]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [105]:
# 특정 열을 데이터프레임의 행 인덱스(index)fh tjfwjd

In [106]:
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [107]:
ndf2 = ndf.set_index('음악')

In [108]:
ndf2

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

In [109]:
ndf3 = ndf.set_index(['수학', '음악'])
ndf3

        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

In [110]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])

In [111]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [112]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']

In [113]:
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [114]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [115]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [116]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [117]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [118]:
ndf = df.sort_index(ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [119]:
ndf = df.sort_values(by='c1', ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

## 4. 산술연산

In [120]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student1

국어    100
영어     80
수학     90
dtype: int64

In [121]:
percentage = student1/200

In [122]:
percentage

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [123]:
student2 = pd.Series({'수학':80, '국어':90, '영어':80})

In [124]:
student2

수학    80
국어    90
영어    80
dtype: int64

In [125]:
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2
print(type(division))

<class 'pandas.core.series.Series'>

In [126]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                      index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [127]:
import pandas as pd
import numpy as np

In [128]:
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

In [129]:
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [130]:
student2

수학    80
국어    90
dtype: int64

In [131]:
addition =student1+student2
subtraction=student1+student2
multiplication=student1*student2
division=student1/student2

In [132]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN   170.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [133]:
sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)
sr_mul = student1.mul(student2, fill_value=0)
sr_div = student1.div(student2, fill_value=0)

result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

### 데이터프레임 연산

In [138]:
import pandas as pd
import seaborn as sns

In [142]:
titanic = sns.load_dataset('titanic')

In [143]:
df = titanic.loc[:, ['age', 'fare']]

In [144]:
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [145]:
type(df)

pandas.core.frame.DataFrame

In [146]:
addition = df + 10

In [147]:
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [148]:
subtraction = addition - df
subtraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0